In [2]:
# Pandas library
import pandas as pd

# creating a series
# Series - a series is a one dimensional array like object which is of all data type and is like a column of a table.

data = [1,2,3,4,5]
series = pd.Series(data)    # Series() - creates a series with index 0 till the items in data b default
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
# dictionary series
data = {'a':10,'b':20,'c':30,'d':40}
series = pd.Series(data)
print(series)

a    10
b    20
c    30
d    40
dtype: int64

In [5]:
# indexes for data 
data = [1,2,3,4,5,6]
index = ['a','b','c','d','e','f']

series = pd.Series(data, index=index)     # or pd.Series(data, index=['a','b','c','d','e','f'])
print("Series: \n",series)
print(type(series))

Series:
 a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64
<class 'pandas.core.series.Series'>

In [13]:
# creating data frame using dictionary with list as values
# Dataframe - a two dimensional array (like a spreadsheet), size-mutable with potential heterogeneous tabular data structure with rows and columns.
data = {
    "Name": ["Tom", "Nick", "John", "Peter"],
    "Age": [20, 21, 19, 18],
    "Score": [90, 85, 88, 92]
}

df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age  Score
0    Tom   20     90
1   Nick   21     85
2   John   19     88
3  Peter   18     92
<class 'pandas.core.frame.DataFrame'>

In [7]:
# can also convert and store it in a list
import numpy as np
arr1 = np.array(df)
print(arr1)
print(type(arr1))

2.2.2
[['Tom' 20 90]
 ['Nick' 21 85]
 ['John' 19 88]
 ['Peter' 18 92]]
<class 'numpy.ndarray'>

In [2]:
# creating Dataframe from a list of dictionaries
import pandas as pd
data = [
    {'Name':'naruto','Age':'25','City':'konoha'},            # rows in the data frame
    {'Name':'sasuke','Age':'25','City':'konoha'},
    {'Name':'sakura','Age':'25','City':'konoha'},
    {'Name':'kakashi','Age':'35','City':'konoha'},
    {'Name':'tsunade','Age':'40','City':'konoha'},
]
df = pd.DataFrame(data)
print(df)
print(type(df))

      Name Age    City
0   naruto  25  konoha
1   sasuke  25  konoha
2   sakura  25  konoha
3  kakashi  35  konoha
4  tsunade  40  konoha
<class 'pandas.core.frame.DataFrame'>

In [4]:
# reading data from csv file, excel file..
try:
    df = pd.read_csv('file.csv')
    df = pd.read_excel('file.xlsx')
except FileNotFoundError:
    print("This how you use the read function to read the csv and excel file.")

This how you use the read function to read the csv and excel file.

In [ ]:
df = pd.read_csv('car_data.csv')
print(df.head(5))         # shows first 5 rows

In [ ]:
print(df.tail())       # shows the last 5 rows

In [ ]:
print(df.shape)     # shows the shape of the dataframe
print(df.info())    # shows data types, non-null values

In [ ]:
df.isnull()     # chech for missing values
#df.fillna(0)   - replace missing values with 0
#df.dropna()    - removes rows with missing values

In [18]:
# Accessing data in dataframe

print(df['Name'])          # selecting single column 
print(type(df['Name']))    # single column ultimately is a series
print(df[['Name', 'Age']])  # selecting multiple columns

0      Tom
1     Nick
2     John
3    Peter
Name: Name, dtype: object
<class 'pandas.core.series.Series'>
    Name  Age
0    Tom   20
1   Nick   21
2   John   19
3  Peter   18

In [26]:
df

    Name  Age  Score
0    Tom   20     90
1   Nick   21     85
2   John   19     88
3  Peter   18     92

In [24]:
df.loc[1]             # location : access a group of rows or columns by their labels

Name     Nick
Age        21
Score      85
Name: 1, dtype: object

In [70]:
df.loc[0]

Name     Tom
Age       20
Score     90
Grade      F
Name: 0, dtype: object

In [38]:
# index location : integer-based (positional) indexing to select rows and columns by their numerical index positions.
df.iloc[1]                  # select the first row index = 0
print(df.iloc[[0,2]])       # select the first and third row
print(df.iloc[0:2])         # prnts range of rows (2 is exlusive)

   Name  Age  Score
0   Tom   20     90
2  John   19     88
   Name  Age  Score
0   Tom   20     90
1  Nick   21     85

In [39]:
# selecting a single value
print(df.iloc[1,2])     # row index 1, column index 2
print(df.iloc[0][1])

85
20

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_3544\3641600335.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.iloc[0][1])

In [42]:
# Accessing a specific value using at() function
df.at[2,"Name"]

'John'

In [ ]:
# Accessing a specific value using iat() function - can specify both row and column index
df.iat[2,0]

'John'

In [46]:
df

    Name  Age  Score
0    Tom   20     90
1   Nick   21     85
2   John   19     88
3  Peter   18     92

In [60]:
# Adding a column
df['Country'] = ['America','Germany','Switzerland','England']
df

    Name  Age  Score      Country
0    Tom   20     90      America
1   Nick   21     85      Germany
2   John   19     88  Switzerland
3  Peter   18     92      England

In [61]:
# Removing a column
df.drop('Country', axis=1)        # by default it tries to remove the rows, unless axis is specified

    Name  Age  Score
0    Tom   20     90
1   Nick   21     85
2   John   19     88
3  Peter   18     92

In [62]:
# drop removes the column temporarily until the inplace is true
df

    Name  Age  Score      Country
0    Tom   20     90      America
1   Nick   21     85      Germany
2   John   19     88  Switzerland
3  Peter   18     92      England

In [63]:
df.drop('Country', axis=1, inplace=True)
df

    Name  Age  Score
0    Tom   20     90
1   Nick   21     85
2   John   19     88
3  Peter   18     92

In [68]:
for index,score in enumerate(df['Score']):
    if score > 90:
        df.loc[index,'Grade'] = 'A'
    else:
        df.loc[index,'Grade'] = 'F'

df

    Name  Age  Score Grade
0    Tom   20     90     F
1   Nick   21     85     F
2   John   19     88     F
3  Peter   18     92     A

In [ ]:
# aggregate and groupby agg() function - when performing various operations while grouping by use agg().
import pandas as pd

# Create sample data
data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie'],
    'Subject': ['Math', 'Math', 'Math', 'Science', 'Science', 'Science'],
    'Score': [85, 90, 78, 92, 88, 80]
}

df = pd.DataFrame(data)
print(df)

   Student  Subject  Score
0    Alice     Math     85
1      Bob     Math     90
2  Charlie     Math     78
3    Alice  Science     92
4      Bob  Science     88
5  Charlie  Science     80

In [3]:
aggregate_data = df.groupby('Student')['Score'].agg(['mean','sum','count'])
print(aggregate_data)

         mean  sum  count
Student
Alice    88.5  177      2
Bob      89.0  178      2
Charlie  79.0  158      2